Revit 2026 API

# FabricationNetworkChangeServiceChangeService(ISetElementId, Int32, Int32, Boolean) Method

---
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FabricationNetworkChangeServiceResult ChangeService(
	ISet<ElementId> selection,
	int serviceId,
	int paletteId,
	bool restrictPalette
)
```
```vb
Public Function ChangeService (
	selection As ISet(Of ElementId),
	serviceId As Integer,
	paletteId As Integer,
	restrictPalette As Boolean
) As FabricationNetworkChangeServiceResult
```
```cpp
public:
FabricationNetworkChangeServiceResult ChangeService(
	ISet<ElementId^>^ selection,
	int serviceId,
	int paletteId,
	bool restrictPalette
)
```
```fsharp
member ChangeService :
        selection : ISet<ElementId> *
        serviceId : int *
        paletteId : int *
        restrictPalette : bool -> FabricationNetworkChangeServiceResult
```

#### Parameters

selection ISetElementId

serviceId Int32

paletteId Int32

restrictPalette Boolean

#### Return Value

FabricationNetworkChangeServiceResult

#### Reference

FabricationNetworkChangeService Class

ChangeService Overload

Autodesk.Revit.DB.Fabrication Namespace